tutorials/blockMeshDict_m4/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//------------------------------- nanoFluid4Foam project -------------------------------//
//Author
    //Ehsan Golab, SUT. All rights reserved.
    //Ehsan1996Golab@gmail.com

//--------------------------------------------------------------------------------------//

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:









//variables








// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.001;

vertices
(
    //-Back
    (    -50    0.0    -5    ) // Vertex B0 = 0 
    (    50    0.0    -5    ) // Vertex B1 = 1 
    (    100    200    -5    ) // Vertex B2 = 2 
    (    -100    200    -5    ) // Vertex B3 = 3 

    //-Front
    (    -50    0.0    5    ) // Vertex F0 = 4 
    (    50    0.0    5    ) // Vertex F1 = 5 
    (    100    200    5    ) // Vertex F2 = 6 
    (    -100    200    5    ) // Vertex F3 = 7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
