tutorials/blockMeshDict_m4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        nFaces          40;
        startFace       3910;
    }
    bottom
    {
        type            wall;
        nFaces          40;
        startFace       3950;
    }
    right
    {
        type            wall;
        nFaces          50;
        startFace       3990;
    }
    left
    {
        type            wall;
        nFaces          50;
        startFace       4040;
    }
    frontAndBack
    {
        type            empty;
        nFaces          4000;
        startFace       4090;
    }
)


// ************************************************************************* //
